from random import randint
from random import random
from random import randrange
from random import uniform

"""
+-------------------------------------+----------------------------------------------------------------+
| random.randrange(start, stop, step) | возвращает случайно выбранное число из последовательности.     |
+-------------------------------------+----------------------------------------------------------------+
| random.randint(A, B)                | случайное целое число N, A ≤ N ≤ B.                            |
+-------------------------------------+----------------------------------------------------------------+
| random.random()                     | случайное число от 0 до 1.                                     |
+-------------------------------------+----------------------------------------------------------------+
| random.uniform(A, B)                | случайное число с плавающей точкой, A ≤ N ≤ B (или B ≤ N ≤ A). |
+-------------------------------------+----------------------------------------------------------------+
"""

# range(1, 10)      1 2 3 4 5 6 7 8 9
# randrange(1, 10)  4 7 1 8 2 3 1 9 2

# randrange
for _ in range(15):
    print(randrange(1, 10, 2), end=', ')
print()

# randint
for _ in range(15):
    print(randint(1, 10), end=', ')
print()

# random
for _ in range(15):
    print(round(random(), 2), end=', ')
print()

# uniform
for _ in range(15):
    print(round(uniform(1, 9), 3), end=', ')
print()
